
# Введение в SQL

Добро пожаловать на SQLBolt, серию интерактивных уроков и упражнений, разработанных для того, чтобы помочь вам быстро освоить SQL прямо в вашем браузере.

### Что такое SQL?

SQL, или Язык структурированных запросов, - это язык, разработанный для того, чтобы позволить как техническим, так и нетехническим пользователям запрашивать, манипулировать и преобразовывать данные из реляционной базы данных.  Благодаря своей простоте базы данных SQL обеспечивают безопасное и масштабируемое хранилище для миллионов веб-сайтов и мобильных приложений.

>Знаете ли вы?
>Существует множество популярных баз данных SQL, включая SQLite, MySQL, Postgres, Oracle и Microsoft SQL Server.  Все они поддерживают общий стандарт языка SQL, о котором будет рассказано на этом сайте, но каждая реализация может отличаться дополнительными функциями и типами хранилища, которые она поддерживает.

### Реляционные базы данных

Прежде чем изучать синтаксис SQL, важно иметь модель того, что на самом деле представляет собой реляционная база данных.  Реляционная база данных представляет собой набор связанных (двумерных) таблиц.  Каждая из таблиц похожа на электронную таблицу Excel с фиксированным количеством именованных столбцов (атрибутов или свойств таблицы) и любым количеством строк данных.

Например, если бы у Департамента транспортных средств была база данных, вы могли бы найти таблицу, содержащую все известные транспортные средства, которыми управляют люди в штате.  В этой таблице может потребоваться сохранить, например, название модели, тип, количество колес и дверей каждого транспортного средства.



Таблица: Транспортные Средства

| ID   | Марка / Модель| # Колеса | # Doors | Тип |
| ---- | ------------- |------------- |------------- |------------- |
| 1  | Ford Focus  | 4 | 4 | Седан |
| 2  | Tesla Roadster  | 4 | 2 | Спорт|
| 3  | Kawakasi Ninja  | 2 | 0 | Мотоцикл|
| 4  | McLaren Formula 1  | 4 | 0 | Гонка|
| 5  | Tesla S  | 4 | 4 | Седан|

В такой базе данных вы можете найти дополнительные связанные таблицы, содержащие такую информацию, как список всех зарегистрированных водителей в штате, типы водительских прав, которые могут быть выданы, или даже нарушения правил вождения по каждому водителю.

Цель изучения SQL - научиться отвечать на конкретные вопросы об этих данных, например,  _"У каких типов транспортных средств на дорогах меньше четырех колес?"_  или  _"Сколько моделей автомобилей производит Tesla?"_, чтобы помочь нам принимать более эффективные решения в будущем.

### Об уроках

Поскольку большинство пользователей будут изучать SQL для взаимодействия с существующей базой данных, уроки начинаются с ознакомления с различными частями SQL-запроса.  В последующих уроках будет показано, как изменять таблицу (или схему) и создавать новые таблицы с нуля.

Каждый урок знакомит с другой концепцией и заканчивается интерактивным упражнением.  Двигайтесь в своем темпе и не бойтесь потратить время на эксперименты с упражнениями, прежде чем продолжить!  Если вы уже знакомы с SQL, вы можете пропустить его дальше, воспользовавшись ссылками в правом верхнем углу, но мы бы рекомендовали вам в любом случае изучить уроки!

Мы надеемся, что к концу у вас будет прочная основа для использования SQL в ваших собственных проектах и за их пределами.
