
## SQL Урок 1: ВЫБОР запросов 101

Чтобы извлечь данные из базы данных SQL, нам нужно написать  `SELECT`  инструкции, которые часто в просторечии называются  _запросами_.  Запрос сам по себе - это просто оператор, который объявляет, какие данные мы ищем, где их найти в базе данных и, при необходимости, как преобразовать их перед возвратом.  Однако у него особый синтаксис, который мы собираемся изучить в следующих упражнениях.

Как мы упоминали во введении, вы можете думать о таблице в SQL как о типе сущности (т.е.  Собаки), и каждая строка в этой таблице как определенный  _экземпляр_  этого типа (например.  Мопс, бигль, мопс другого цвета и т.д.).  Это означает, что столбцы будут представлять общие свойства, общие для всех экземпляров этой сущности (например.  Цвет меха, длина хвоста и т.д.).

Учитывая таблицу данных, самым простым запросом, который мы могли бы написать, был бы запрос, который выбирает пару столбцов (свойств) таблицы со всеми строками (экземплярами).

Выберите запрос для определенных столбцов

```
SELECT column, another_column, … 
FROM mytable;
```

> SELECT - выбрать (используется для извлечения данных из базы данных.)
> column - столбец, поле, колонка
> другой_столбец
> FROM - из
> Обратите внимание, что запрос заканчивается `;`

Результатом этого запроса будет двумерный набор строк и столбцов, фактически копия таблицы, но только с теми столбцами, которые мы запросили.

Если мы хотим получить абсолютно все столбцы данных из таблицы, мы можем использовать сокращение от звездочки (`*`) вместо перечисления всех имен столбцов по отдельности.

Выберите запрос для всех столбцов
```
SELECT * 
FROM mytable;
```
Этот запрос, в частности, действительно полезен, потому что это простой способ проверить таблицу, выгрузив все данные сразу.

### Упражнение

Для большинства наших упражнений мы будем использовать базу данных с данными о некоторых классических фильмах Pixar.  В этом первом упражнении будет задействована только таблица  **Movies**, и приведенный ниже запрос по умолчанию в настоящее время показывает все свойства каждого фильма.  Чтобы перейти к следующему уроку, измените запрос, чтобы найти точную информацию, необходимую нам для каждой задачи.
